; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 384984 2 3 2 3 3
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	spectrograph1 - mode
	image0 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation0 - direction
	Planet3 - direction
	Planet4 - direction
	Star5 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 spectrograph1)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
	(supports instrument3 spectrograph1)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 image0)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
)
(:goal (and
	(pointing satellite0 Star5)
	(pointing satellite1 GroundStation0)
	(have_image Planet3 image0)
	(have_image Planet4 image0)
	(have_image Star5 spectrograph1)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 5
2. (turn_to satellite0 star5 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star5)
   goals met: 1 of 5
3. (switch_on instrument5 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument5)
   goals met: 1 of 5
4. (turn_to satellite1 groundstation0 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 groundstation0)
   goals met: 2 of 5
5. (calibrate satellite1 instrument5 groundstation0)
   added: (calibrated instrument5)
   goals met: 2 of 5
6. (turn_to satellite0 groundstation2 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation2)
   goals met: 1 of 5
7. (turn_to satellite1 planet4 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 planet4)
   goals met: 0 of 5
8. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 0 of 5
9. (take_image satellite1 planet4 instrument5 image0)
   added: (have_image planet4 image0)
   goals met: 1 of 5
10. (turn_to satellite0 star5 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star5)
   goals met: 2 of 5
11. (turn_to satellite1 groundstation0 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 groundstation0)
   goals met: 3 of 5
12. (take_image satellite0 star5 instrument1 spectrograph1)
   added: (have_image star5 spectrograph1)
   goals met: 4 of 5
13. (turn_to satellite0 planet3 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet3)
   goals met: 3 of 5
14. (take_image satellite0 planet3 instrument1 image0)
   added: (have_image planet3 image0)
   goals met: 4 of 5
15. (turn_to satellite0 star5 planet3)
   deleted: (pointing satellite0 planet3)
   added: (pointing satellite0 star5)
   goals met: 5 of 5
